Documents/ПлатежноеПоручениеИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПлатежноеПоручениеИсходящее</Name>
			<BasedOn>
				<xr:Item>Document.ВыводДенежныхСредств</xr:Item>
				<xr:Item>Document.НачислениеДивидендов</xr:Item>
				<xr:Item>Document.НачислениеЗадолженности</xr:Item>
				<xr:Item>Document.Оплата</xr:Item>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
				<xr:Item>Document.Сделка</xr:Item>
				<xr:Item>Document.СделкаРЕПО</xr:Item>
				<xr:Item>Document.РазмещениеКредитногоИнструмента</xr:Item>
				<xr:Item>Document.Распоряжение</xr:Item>
				<xr:Item>Document.ПереводДенежныхСредств</xr:Item>
				<xr:Item>Document.ПогашениеПаев</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередностьПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Comment>поле 22 "Код"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоПоручения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеПлатежногоПоручения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ШаблоныНазначенияПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныНазначенияПлатежа</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийБэкОфиса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженностиИлиДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлиентыДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КлиентыДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КлиентыДоверительногоУправления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыСчетовДоверительногоУправленияУБрокеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыСчетовДоверительногоУправленияУБрокеров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодFORTS</Name>
					<Comment>Код счета д/у на рынке Forts</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОсновнойБрокер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорБрокерскогоОбслуживания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НомераОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НомераОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНумерации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНумерацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыводЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
						<v8:Type>cfg:DocumentRef.АнкетаФизическогоЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыОтветаНаЗаявкуПайщикаОЗачисленииПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтветаНаЗаявкуПайщикаОЗачисленииПаев</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолученОтчетОВозможностиВыдачиПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученОтчетОНевозможностиВыдачиПаев</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыВходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыВходящихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Счет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетБрокера</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПлатежноеПоручениеИсходящее/Ext/ManagerModule.bsl
Функция ТекстПолучателя(Дата, Организация, Контрагент, КодБюджетнойКлассификации = Неопределено) Экспорт	
	
	Запрос = Новый Запрос(
	  	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	  	|	ВЫБОР
	  	|		КОГДА ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, """") <> """"
	  	|			ТОГДА ЗначенияДополнительныхСведений.Значение
	  	|		КОГДА ЮрФизЛица.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
	  	|			ТОГДА ЕСТЬNULL(РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу, РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу)
	  	|		ИНАЧЕ РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество
	  	|	КОНЕЦ КАК ТекстПолучателя
	  	|ИЗ
	  	|	Справочник.ЮрФизЛица КАК ЮрФизЛица
	  	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
	  	|				&Дата,
	  	|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
	  	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
	  	|		ПО ЮрФизЛица.Ссылка = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
	  	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	  	|				&Дата,
	  	|				Организация = &Организация
	  	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
	  	|		ПО ЮрФизЛица.Ссылка = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
	  	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
	  	|				&Дата,
	  	|				Организация = &Организация
	  	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
	  	|		ПО ЮрФизЛица.Ссылка = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
	  	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
	  	|		ПО (ВЫРАЗИТЬ(ЗначенияДополнительныхСведений.Объект КАК Справочник.КодыБюджетнойКлассификации).Код = &КодБюджетнойКлассификации)
	  	|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""НаименованиеВПлатежномПоручении"")
	  	|ГДЕ
	  	|	ЮрФизЛица.Ссылка = &Контрагент");
	
	Запрос.УстановитьПараметр("Дата", 						?(Дата = '00010101', ТекущаяДатаСеанса(), Дата));
	Запрос.УстановитьПараметр("Организация", 				Организация);
	Запрос.УстановитьПараметр("Контрагент", 				Контрагент);
	Запрос.УстановитьПараметр("КодБюджетнойКлассификации",	КодБюджетнойКлассификации);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		Возврат Выборка.ТекстПолучателя;
	КонецЕсли;

	Возврат "";
	
КонецФункции

Функция ТекстНазначенияПлатежа(ДокументОбъект) Экспорт
	
	Основания = ДокументОбъект.Основания.Выгрузить().ВыгрузитьКолонку("Основание");
	Результат = "<Необходимо заполнить текст вручную>";
	
	Если Основания.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТипОснования = ТипЗнч(Основания[0]);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; 
	
	Запрос.УстановитьПараметр("Организация",			ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицоОрганизации",	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("Дата", 					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основания[0], "Дата"));
	Запрос.УстановитьПараметр("Основания",				Основания);
	
	Если Основания[0].Метаданные().Имя = "Распоряжение" Тогда
		ВидОперацииБэкОфиса = Перечисления.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента;
	ИначеЕсли Основания[0].Метаданные().Имя = "ПоручениеНаПереводДенежныхСредств"
		Или Основания[0].Метаданные().Имя = "ВводДенежныхСредств" Тогда
		ВидОперацииБэкОфиса = Перечисления.ВидыОперацийБэкОфиса.ПереводДенежныхСредств;
	ИначеЕсли Основания[0].Метаданные().Имя = "ПогашениеПаев" Тогда
		ВидОперацииБэкОфиса = Перечисления.ВидыОперацийБэкОфиса.ВыводДенежныхСредств;
	ИначеЕсли Основания[0].Метаданные().Имя = "РасчетНДФЛПайщиков" Тогда
		ВидОперацииБэкОфиса = Перечисления.ВидыОперацийБэкОфиса.Оплата;	
	Иначе	
		ВидОперацииБэкОфиса = Перечисления.ВидыОперацийБэкОфиса[Основания[0].Метаданные().Имя];
	КонецЕсли;
	
	Если ТипОснования = Тип("ДокументСсылка.Оплата") Тогда
				
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.НачислениеЗадолженности)
			|			ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.НачислениеЗадолженности).НомерВходящегоДокумента
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК НомерВходящегоДокумента,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.НачислениеЗадолженности)
			|			ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.НачислениеЗадолженности).ДатаВходящегоДокумента
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ДатаВходящегоДокумента,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ОплатаОснования.Основание) = ТИП(Документ.НачислениеЗадолженности)
			|			ТОГДА ВЫРАЗИТЬ(ОплатаОснования.Основание КАК Документ.НачислениеЗадолженности).ВидВходящегоДокумента
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ВидВходящегоДокумента,
			|	ОплатаОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
			|	ОплатаОснования.Ссылка.Договор.НомерДоговора КАК НомерДоговора,
			|	ОплатаОснования.Ссылка.Договор.ДатаЗаключения КАК ДатаЗаключения,
			|	ОплатаОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОплатаОснования.Ссылка.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка) КАК ВидДоговораДоверительногоУправленияДляШаблона,
			|	ОплатаОснования.Ссылка.СчетДоверительногоУправления.ДатаЗаключения КАК СчетДУ_ДатаЗаключения,
			|	ОплатаОснования.Ссылка.СчетДоверительногоУправления.НомерДоговора КАК СчетДУ_НомерДоговора,
			|	ОплатаОснования.Ссылка.Контрагент КАК Контрагент,
			|	ОплатаОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженностиИлиДоговора,
			|	НАЧАЛОПЕРИОДА(ОплатаОснования.Ссылка.ДатаПлановогоПогашенияЗадолженности, МЕСЯЦ) КАК НачалоПериодаНачисления,
			|	КОНЕЦПЕРИОДА(ОплатаОснования.Ссылка.ДатаПлановогоПогашенияЗадолженности, МЕСЯЦ) КАК ОкончаниеПериодаНачисления,
			|	ЕСТЬNULL(ДопСведенияДокументаНомер.Значение, ""______"") КАК НомерДополнительногоДокумента,
			|	ЕСТЬNULL(ДопСведенияДокументаДата.Значение, ""______"") КАК ДатаДополнительногоДокумента
			|ПОМЕСТИТЬ _ДанныеОснований
			|ИЗ
			|	Документ.Оплата.Основания КАК ОплатаОснования
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ДопСведенияДокументаНомер
			|		ПО ОплатаОснования.Ссылка = ДопСведенияДокументаНомер.Объект
			|			И (ДопСведенияДокументаНомер.Свойство.Ключ = ""НомерДополнительногоДокумента"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ДопСведенияДокументаДата
			|		ПО ОплатаОснования.Ссылка = ДопСведенияДокументаДата.Объект
			|			И (ДопСведенияДокументаДата.Свойство.Ключ = ""ДатаДополнительногоДокумента"")
			|ГДЕ
			|	ОплатаОснования.Ссылка В(&Основания)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_ДанныеОснований.НомерДоговора КАК НомерДоговора
			|ПОМЕСТИТЬ _Договоры
			|ИЗ
			|	_ДанныеОснований КАК _ДанныеОснований";
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда	
				
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НачислениеЗадолженности.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
			|	НачислениеЗадолженности.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
			|	НачислениеЗадолженности.ВидВходящегоДокумента КАК ВидВходящегоДокумента,
			|	НачислениеЗадолженности.ВидЗадолженности КАК ВидЗадолженности,
			|	ВЫБОР
			|		КОГДА НачислениеЗадолженности.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющегоПлатаЗаРазмещение))
			|			ТОГДА НачислениеЗадолженности.СчетДоверительногоУправления.НомерДоговора
			|		ИНАЧЕ НачислениеЗадолженности.Договор.НомерДоговора
			|	КОНЕЦ КАК НомерДоговора,
			|	ВЫБОР
			|		КОГДА НачислениеЗадолженности.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющегоПлатаЗаРазмещение))
			|			ТОГДА НачислениеЗадолженности.СчетДоверительногоУправления.ДатаЗаключения
			|		ИНАЧЕ НачислениеЗадолженности.Договор.ДатаЗаключения
			|	КОНЕЦ КАК ДатаЗаключения,
			|	НачислениеЗадолженности.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	НачислениеЗадолженности.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
			|	ЕСТЬNULL(ШаблоныНазначенияПлатежаСрезПоследних.ВидДоговораДоверительногоУправления, ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)) КАК ВидДоговораДоверительногоУправленияДляШаблона,
			|	НачислениеЗадолженности.СчетДоверительногоУправления.ДатаЗаключения КАК СчетДУ_ДатаЗаключения,
			|	НачислениеЗадолженности.СчетДоверительногоУправления.НомерДоговора КАК СчетДУ_НомерДоговора,
			|	НачислениеЗадолженности.НачалоПериодаНачисления КАК НачалоПериодаНачисления,
			|	НачислениеЗадолженности.ОкончаниеПериодаНачисления КАК ОкончаниеПериодаНачисления,
			|	ЕСТЬNULL(ШаблоныНазначенияПлатежаСрезПоследних.Контрагент, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) КАК Контрагент,
			|	НачислениеЗадолженности.ВидЗадолженности КАК ВидЗадолженностиИлиДоговора,
			|	ЕСТЬNULL(ДопСведенияДокументаНомер.Значение, ""______"") КАК НомерДополнительногоДокумента,
			|	ЕСТЬNULL(ДопСведенияДокументаДата.Значение, ""______"") КАК ДатаДополнительногоДокумента,
			|	ЕСТЬNULL(ДопСведенияДоговораНомер.Значение, ""______"") КАК НомерДополнительногоСоглашения,
			|	ЕСТЬNULL(ДопСведенияДоговораДата.Значение, ""______"") КАК ДатаДополнительногоСоглашения,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(КлиентыДоверительногоУправленияСрезПоследних.Клиент) = ТИП(Справочник.ПаевыеИнвестиционныеФонды)
			|			ТОГДА РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ВЫРАЗИТЬ(КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Справочник.ЮрФизЛица).ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
			|					ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество
			|				ИНАЧЕ РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу
			|			КОНЕЦ
			|	КОНЕЦ КАК НаименованиеКлиента,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(КлиентыДоверительногоУправленияСрезПоследних.Клиент) = ТИП(Справочник.ПаевыеИнвестиционныеФонды)
			|			ТОГДА ВЫРАЗИТЬ(КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).НомерПравил
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК НомерПравил,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(КлиентыДоверительногоУправленияСрезПоследних.Клиент) = ТИП(Справочник.ПаевыеИнвестиционныеФонды)
			|			ТОГДА ВЫРАЗИТЬ(КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Справочник.ПаевыеИнвестиционныеФонды).ДатаПравил
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ДатаПравил
			|ПОМЕСТИТЬ _ДанныеОснований
			|ИЗ
			|	Документ.НачислениеЗадолженности КАК НачислениеЗадолженности
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШаблоныНазначенияПлатежа.СрезПоследних(
			|				&Дата,
			|				Организация = &Организация
			|					И ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.НачислениеЗадолженности)) КАК ШаблоныНазначенияПлатежаСрезПоследних
			|		ПО НачислениеЗадолженности.ВидЗадолженности = ШаблоныНазначенияПлатежаСрезПоследних.ВидЗадолженностиИлиДоговора
			|			И (НачислениеЗадолженности.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ШаблоныНазначенияПлатежаСрезПоследних.ВидДоговораДоверительногоУправления
			|				ИЛИ НачислениеЗадолженности.Контрагент = ШаблоныНазначенияПлатежаСрезПоследних.Контрагент)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ДопСведенияДокументаНомер
			|		ПО НачислениеЗадолженности.Ссылка = ДопСведенияДокументаНомер.Объект
			|			И (ДопСведенияДокументаНомер.Свойство.Ключ = ""НомерДополнительногоДокумента"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ДопСведенияДокументаДата
			|		ПО НачислениеЗадолженности.Ссылка = ДопСведенияДокументаДата.Объект
			|			И (ДопСведенияДокументаДата.Свойство.Ключ = ""ДатаДополнительногоДокумента"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ДопСведенияДоговораНомер
			|		ПО НачислениеЗадолженности.Договор = ДопСведенияДоговораНомер.Объект
			|			И (ДопСведенияДоговораНомер.Свойство.Ключ = ""НомерДополнительногоДокумента"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ДопСведенияДоговораДата
			|		ПО НачислениеЗадолженности.Договор = ДопСведенияДоговораДата.Объект
			|			И (ДопСведенияДоговораДата.Свойство.Ключ = ""ДатаДополнительногоДокумента"")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Дата, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
			|		ПО НачислениеЗадолженности.Организация = КлиентыДоверительногоУправленияСрезПоследних.Организация
			|			И НачислениеЗадолженности.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Дата, ) КАК РеквизитыПИФСрезПоследних
			|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
			|				&Дата,
			|				Организация = &Организация
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
			|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|				&Дата,
			|				Организация = &Организация
			|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
			|		ПО (КлиентыДоверительногоУправленияСрезПоследних.Клиент = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо)
			|ГДЕ
			|	НачислениеЗадолженности.Ссылка В(&Основания)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_ДанныеОснований.НомерДоговора КАК НомерДоговора
			|ПОМЕСТИТЬ _Договоры
			|ИЗ
			|	_ДанныеОснований КАК _ДанныеОснований";	
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда	
		
		Запрос.УстановитьПараметр(
			"ИспользоватьОтборПоВидуДоговораДоверительногоУправленияВместоКонтрагента", 
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					Основания[0], 
					"СчетДоверительногоУправления.ВидДоговораДоверительногоУправления") = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов);	
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПоручениеНаДвижениеДенежныхСредств.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
			|	ПоручениеНаДвижениеДенежныхСредств.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
			|	ПоручениеНаДвижениеДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ПоручениеНаДвижениеДенежныхСредств.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
			|	ВЫБОР
			|		КОГДА &ИспользоватьОтборПоВидуДоговораДоверительногоУправленияВместоКонтрагента
			|			ТОГДА ПоручениеНаДвижениеДенежныхСредств.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка)
			|	КОНЕЦ КАК ВидДоговораДоверительногоУправленияДляШаблона,
			|	ПоручениеНаДвижениеДенежныхСредств.СчетДоверительногоУправления.ДатаЗаключения КАК СчетДУ_ДатаЗаключения,
			|	ПоручениеНаДвижениеДенежныхСредств.СчетДоверительногоУправления.НомерДоговора КАК СчетДУ_НомерДоговора,
			|	"""" КАК НомерДоговора,
			|	"""" КАК ДатаЗаключения,
			|	ПоручениеНаДвижениеДенежныхСредств.НазначениеПлатежа КАК НазначениеПлатежа,
			|	ВЫБОР
			|		КОГДА &ИспользоватьОтборПоВидуДоговораДоверительногоУправленияВместоКонтрагента
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
			|		ИНАЧЕ ПоручениеНаДвижениеДенежныхСредств.Контрагент
			|	КОНЕЦ КАК Контрагент,
			|	НЕОПРЕДЕЛЕНО КАК ВидЗадолженностиИлиДоговора
			|ПОМЕСТИТЬ _ДанныеОснований
			|ИЗ
			|	Документ.ПоручениеНаДвижениеДенежныхСредств КАК ПоручениеНаДвижениеДенежныхСредств
			|ГДЕ
			|	ПоручениеНаДвижениеДенежныхСредств.Ссылка В(&Основания)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_ДанныеОснований.СчетДУ_НомерДоговора КАК НомерДоговора
			|ПОМЕСТИТЬ _Договоры
			|ИЗ
			|	_ДанныеОснований КАК _ДанныеОснований";
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") 
		Или ТипОснования = Тип("ДокументСсылка.ПереводДенежныхСредств") Тогда	
		
		Запрос.УстановитьПараметр("БрокерБКРегион",	ОбщегоНазначения.ПолучитьИменованныйОбъект("Брокер_БК_Регион"));
		Запрос.УстановитьПараметр("НКО_НКЦ",		ОбщегоНазначения.ПолучитьИменованныйОбъект("НКО_НКЦ"));
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	"""" КАК НомерВходящегоДокумента,
			|	NULL КАК ДатаВходящегоДокумента,
			|	ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка) КАК ВидДоговораДоверительногоУправленияДляШаблона,
			|	ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления.ДатаЗаключения КАК СчетДУ_ДатаЗаключения,
			|	ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления.НомерДоговора КАК СчетДУ_НомерДоговора,
			|	КодыСчетовУБрокераСрезПоследних.ДоговорБрокерскогоОбслуживания.НомерДоговора КАК НомерДоговора,
			|	КодыСчетовУБрокераСрезПоследних.ДоговорБрокерскогоОбслуживания.ДатаЗаключения КАК ДатаЗаключения,
			|	ВЫБОР
			|		КОГДА ПоручениеНаПереводДенежныхСредств.МестоХраненияПолучатель = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
			|			ТОГДА ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, """")
			|		ИНАЧЕ УсловияДоговоровБрокерскогоОбслуживанияСрезПоследних.ФРОРК
			|	КОНЕЦ КАК ФРОРК,
			|	"""" КАК НазначениеПлатежа,
			|	ВЫБОР
			|		КОГДА ПоручениеНаПереводДенежныхСредств.БрокерПолучатель = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
			|				И ПоручениеНаПереводДенежныхСредств.МестоХраненияПолучатель = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
			|			ТОГДА &НКО_НКЦ
			|		КОГДА ПоручениеНаПереводДенежныхСредств.БрокерПолучатель = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
			|			ТОГДА &ЮрФизЛицоОрганизации
			|		КОГДА ПоручениеНаПереводДенежныхСредств.БрокерПолучатель = &БрокерБКРегион
			|				И ПоручениеНаПереводДенежныхСредств.МестоХраненияПолучатель <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
			|			ТОГДА &НКО_НКЦ
			|		ИНАЧЕ ПоручениеНаПереводДенежныхСредств.БрокерПолучатель.ЮрФизЛицо
			|	КОНЕЦ КАК Контрагент,
			|	ВЫБОР
			|		КОГДА ПоручениеНаПереводДенежныхСредств.МестоХраненияПолучатель = ЗНАЧЕНИЕ(Справочник.МестаХранения.ММВБ_ДепозитыСЦК)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.БанковскогоДепозита)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.БрокерскогоОбслуживания)
			|	КОНЕЦ КАК ВидЗадолженностиИлиДоговора
			|ПОМЕСТИТЬ _ДанныеОснований
			|ИЗ
			|	&Документ КАК ПоручениеНаПереводДенежныхСредств
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&Дата, Организация = &Организация) КАК КодыСчетовУБрокераСрезПоследних
			|		ПО ПоручениеНаПереводДенежныхСредств.Организация = КодыСчетовУБрокераСрезПоследних.Организация
			|			И ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления = КодыСчетовУБрокераСрезПоследних.СчетДоверительногоУправления
			|			И ПоручениеНаПереводДенежныхСредств.БрокерПолучатель = КодыСчетовУБрокераСрезПоследних.Брокер
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровБрокерскогоОбслуживания.СрезПоследних(&Дата, Организация = &Организация) КАК УсловияДоговоровБрокерскогоОбслуживанияСрезПоследних
			|		ПО (КодыСчетовУБрокераСрезПоследних.Организация = УсловияДоговоровБрокерскогоОбслуживанияСрезПоследних.Организация)
			|			И (КодыСчетовУБрокераСрезПоследних.ДоговорБрокерскогоОбслуживания = УсловияДоговоровБрокерскогоОбслуживанияСрезПоследних.Договор)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
			|		ПО (ЗначенияДополнительныхСведений.Объект = ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления)
			|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""РасчетныйКодНаРынкеДепозитов"")
			|ГДЕ
			|	ПоручениеНаПереводДенежныхСредств.Ссылка В(&Основания)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_ДанныеОснований.СчетДУ_НомерДоговора КАК НомерДоговора
			|ПОМЕСТИТЬ _Договоры
			|ИЗ
			|	_ДанныеОснований КАК _ДанныеОснований";
		 		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
					"&Документ",
					"Документ." 
						+ ?(ТипОснования = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств"),
								"ПоручениеНаПереводДенежныхСредств",
								"ПереводДенежныхСредств")); 
						
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ВводДенежныхСредств") Тогда	
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда КАК НаименованиеКлиента,
			|	ПроцессЗачислениеПаев.НомерОтчетаОВозможностиЗачисленияПаев КАК НомерВходящегоДокумента,
			|	"""" КАК ДатаВходящегоДокумента,
			|	ДокументВводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ДокументВводДенежныхСредств.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда) КАК ВидДоговораДоверительногоУправленияДляШаблона,
			|	ДокументВводДенежныхСредств.СчетДоверительногоУправления.ДатаЗаключения КАК СчетДУ_ДатаЗаключения,
			|	ДокументВводДенежныхСредств.СчетДоверительногоУправления.НомерДоговора КАК СчетДУ_НомерДоговора,
			|	"""" КАК НомерДоговора,
			|	"""" КАК ДатаЗаключения,
			|	"""" КАК НазначениеПлатежа,
			|	ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка) КАК Контрагент,
			|	НЕОПРЕДЕЛЕНО КАК ВидЗадолженностиИлиДоговора,
			|	ДокументВводДенежныхСредств.Сумма КАК Сумма
			|ПОМЕСТИТЬ _ДанныеОснований
			|ИЗ
			|	Документ.ВводДенежныхСредств КАК ДокументВводДенежныхСредств
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.ЗачислениеПаев КАК ПроцессЗачислениеПаев
			|		ПО ДокументВводДенежныхСредств.Организация = ПроцессЗачислениеПаев.Организация
			|			И ДокументВводДенежныхСредств.Ссылка = ПроцессЗачислениеПаев.ВводДенежныхСредств
			|			И (ПроцессЗачислениеПаев.Стартован)
			|			И (НЕ ПроцессЗачислениеПаев.Завершен)
			|			И (НЕ ПроцессЗачислениеПаев.ПометкаУдаления)
			|			И (ПроцессЗачислениеПаев.ОтветОВозможностиЗачисленияПаев = ЗНАЧЕНИЕ(Перечисление.ВариантыОтветаНаЗаявкуПайщикаОЗачисленииПаев.ПолученОтчетОВозможностиВыдачиПаев))
			|			И (ПроцессЗачислениеПаев.НомерОтчетаОВозможностиЗачисленияПаев <> """")
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Дата, ) КАК РеквизитыПИФСрезПоследних
			|		ПО (ПроцессЗачислениеПаев.ЗаявкаПайщика.ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд)
			|ГДЕ
			|	ДокументВводДенежныхСредств.Ссылка В(&Основания)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	_ДанныеОснований.СчетДУ_НомерДоговора КАК НомерДоговора
			|ПОМЕСТИТЬ _Договоры
			|ИЗ
			|	_ДанныеОснований КАК _ДанныеОснований";
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.Распоряжение") Тогда	
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НомераОбъектов.Номер КАК НомерВходящегоДокумента,
			|	Депозиты.Распоряжение.Дата КАК ДатаВходящегоДокумента,
			|	Депозиты.Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	Депозиты.Распоряжение.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка) КАК ВидДоговораДоверительногоУправленияДляШаблона,
			|	Депозиты.Распоряжение.СчетДоверительногоУправления.ДатаЗаключения КАК СчетДУ_ДатаЗаключения,
			|	Депозиты.Распоряжение.СчетДоверительногоУправления.НомерДоговора КАК СчетДУ_НомерДоговора,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ГенСоглашения.Договор.ВидДокументаДляПредставления, """") = """"
			|			ТОГДА ВЫБОР
			|					КОГДА ГенСоглашения.Договор ЕСТЬ NULL
			|						ТОГДА ""договору""
			|					ИНАЧЕ ""Генеральному соглашению""
			|				КОНЕЦ
			|		ИНАЧЕ ГенСоглашения.Договор.ВидДокументаДляПредставления
			|	КОНЕЦ КАК ВидДоговора,
			|	ЕСТЬNULL(ГенСоглашения.Договор.НомерДоговора, ЕСТЬNULL(Депозиты.БанковскийСчет.Договор.НомерДоговора, """")) КАК НомерДоговора,
			|	ЕСТЬNULL(ГенСоглашения.Договор.ДатаЗаключения, ЕСТЬNULL(Депозиты.БанковскийСчет.Договор.ДатаЗаключения, """")) КАК ДатаЗаключения,
			|	ЕСТЬNULL(Депозиты.НомерПодтверждения, """") КАК НомерПодтверждения,
			|	ЕСТЬNULL(Депозиты.ДатаПодтверждения, """") КАК ДатаПодтверждения,
			|	ВЫБОР
			|		КОГДА ГенСоглашения.Договор ЕСТЬ NULL
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.БанковскогоДепозита)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам)
			|	КОНЕЦ КАК ВидЗадолженностиИлиДоговора,
			|	ВЫБОР
			|		КОГДА ГенСоглашения.Договор ЕСТЬ NULL
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
			|		ИНАЧЕ Распоряжения.Банк.ЮрФизЛицо
			|	КОНЕЦ КАК Контрагент
			|ПОМЕСТИТЬ _ДанныеОснований
			|ИЗ
			|	Документ.Распоряжение КАК Распоряжения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераОбъектов КАК НомераОбъектов
			|		ПО (НомераОбъектов.Объект = Распоряжения.Ссылка)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(&Дата, Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам)) КАК ГенСоглашения
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Дата, Организация = &Организация) КАК УсловияДоговоровОбщиеСрезПоследних
			|			ПО ГенСоглашения.Договор = УсловияДоговоровОбщиеСрезПоследних.Договор
			|		ПО Распоряжения.Организация = ГенСоглашения.Организация
			|			И Распоряжения.СчетДоверительногоУправления = ГенСоглашения.СчетДоверительногоУправления
			|			И Распоряжения.Банк.ЮрФизЛицо = ГенСоглашения.Договор.Контрагент
			|			И (ГенСоглашения.Активный)
			|			И (ЕСТЬNULL(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
			|				ИЛИ ЕСТЬNULL(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения, ДАТАВРЕМЯ(1, 1, 1)) >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДепозитныеВклады КАК Депозиты
			|		ПО Распоряжения.Организация = Депозиты.Организация
			|			И Распоряжения.Ссылка = Депозиты.Распоряжение
			|ГДЕ
			|	Распоряжения.Ссылка В(&Основания)";
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РазмещениеКредитногоИнструмента") Тогда	
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РазмещениеКредитногоИнструмента.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	РазмещениеКредитногоИнструмента.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка) КАК ВидДоговораДоверительногоУправленияДляШаблона,
			|	РазмещениеКредитногоИнструмента.СчетДоверительногоУправления.ДатаЗаключения КАК СчетДУ_ДатаЗаключения,
			|	РазмещениеКредитногоИнструмента.СчетДоверительногоУправления.НомерДоговора КАК СчетДУ_НомерДоговора,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ГенСоглашения.Договор.ВидДокументаДляПредставления, """") = """"
			|			ТОГДА ВЫБОР
			|					КОГДА ГенСоглашения.Договор ЕСТЬ NULL
			|						ТОГДА ""договору""
			|					ИНАЧЕ ""Генеральному соглашению""
			|				КОНЕЦ
			|		ИНАЧЕ ГенСоглашения.Договор.ВидДокументаДляПредставления
			|	КОНЕЦ КАК ВидДоговора,
			|	ЕСТЬNULL(ГенСоглашения.Договор.НомерДоговора, ЕСТЬNULL(РазмещениеКредитногоИнструмента.КредитныйИнструмент.БанковскийСчет.Договор.НомерДоговора, """")) КАК НомерДоговора,
			|	ЕСТЬNULL(ГенСоглашения.Договор.ДатаЗаключения, ЕСТЬNULL(РазмещениеКредитногоИнструмента.КредитныйИнструмент.БанковскийСчет.Договор.ДатаЗаключения, """")) КАК ДатаЗаключения,
			|	ЕСТЬNULL(РазмещениеКредитногоИнструмента.КредитныйИнструмент.НомерПодтверждения, """") КАК НомерПодтверждения,
			|	ЕСТЬNULL(РазмещениеКредитногоИнструмента.КредитныйИнструмент.ДатаПодтверждения, """") КАК ДатаПодтверждения,
			|	ВЫБОР
			|		КОГДА ГенСоглашения.Договор ЕСТЬ NULL
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.БанковскогоДепозита)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам)
			|	КОНЕЦ КАК ВидЗадолженностиИлиДоговора,
			|	ВЫБОР
			|		КОГДА ГенСоглашения.Договор ЕСТЬ NULL
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
			|		ИНАЧЕ РазмещениеКредитногоИнструмента.КредитныйИнструмент.БанковскийСчет.ЮрФизЛицо
			|	КОНЕЦ КАК Контрагент
			|ПОМЕСТИТЬ _ДанныеОснований
			|ИЗ
			|	Документ.РазмещениеКредитногоИнструмента КАК РазмещениеКредитногоИнструмента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(&Дата, Договор.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам)) КАК ГенСоглашения
			|		ПО РазмещениеКредитногоИнструмента.Организация = ГенСоглашения.Организация
			|			И РазмещениеКредитногоИнструмента.СчетДоверительногоУправления = ГенСоглашения.СчетДоверительногоУправления
			|			И РазмещениеКредитногоИнструмента.КредитныйИнструмент.БанковскийСчет.Банк.ЮрФизЛицо = ГенСоглашения.Договор.Контрагент
			|			И (ГенСоглашения.Активный)
			|ГДЕ
			|	РазмещениеКредитногоИнструмента.Ссылка В(&Основания)";
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОперацияНДС") Тогда	
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НАЧАЛОПЕРИОДА(ОперацияНДС.Дата, КВАРТАЛ) КАК НачалоПериодаНачисления,
			|	КОНЕЦПЕРИОДА(ОперацияНДС.Дата, КВАРТАЛ) КАК ОкончаниеПериодаНачисления,
			|	ОперацияНДС.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОперацияНДС.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
			|	ОперацияНДС.СчетДоверительногоУправления.ДатаЗаключения КАК СчетДУ_ДатаЗаключения,
			|	ОперацияНДС.СчетДоверительногоУправления.НомерДоговора КАК СчетДУ_НомерДоговора,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ПустаяСсылка) КАК ВидДоговораДоверительногоУправленияДляШаблона,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНалогуНаДобавленнуюСтоимость) КАК ВидЗадолженностиИлиДоговора,
			|	ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка) КАК Контрагент
			|ПОМЕСТИТЬ _ДанныеОснований
			|ИЗ
			|	Документ.ОперацияНДС КАК ОперацияНДС
			|ГДЕ
			|	ОперацияНДС.Ссылка В(&Основания)";
			
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПогашениеПаев") Тогда	
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПогашениеПаев.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда КАК НаименованиеКлиента,
			|	ПогашениеПаев.Заявка.НомерЗаявки КАК НомерВходящегоДокумента,
			|	ПогашениеПаев.Заявка.Дата КАК ДатаВходящегоДокумента,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда) КАК ВидДоговораДоверительногоУправления,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда) КАК ВидДоговораДоверительногоУправленияДляШаблона,
			|	НЕОПРЕДЕЛЕНО КАК ВидЗадолженностиИлиДоговора,
			|	ВЫБОР
			|		КОГДА ПогашениеПаев.Заявка.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)
			|			ТОГДА &ЮрФизЛицоОрганизации
			|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)
			|	КОНЕЦ КАК Контрагент
			|ПОМЕСТИТЬ _ДанныеОснований
			|ИЗ
			|	Документ.ПогашениеПаев КАК ПогашениеПаев
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&Дата, ) КАК РеквизитыПИФСрезПоследних
			|		ПО ПогашениеПаев.ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
			|ГДЕ
			|	ПогашениеПаев.Ссылка В(&Основания)";
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РасчетНДФЛПайщиков") Тогда	
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда) КАК ВидДоговораДоверительногоУправленияДляШаблона,
			|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоНДФЛ13) КАК ВидЗадолженностиИлиДоговора,
			|	ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка) КАК Контрагент
			|ПОМЕСТИТЬ _ДанныеОснований
			|ИЗ
			|	Документ.РасчетНДФЛПайщиков КАК ОперацияНДС
			|ГДЕ
			|	ОперацияНДС.Ссылка В(&Основания)";		
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Заполнение назначения платежа на основании документа '%1' не реализовано", ТипОснования));
		Возврат Результат;
		
	КонецЕсли;
	
	Запрос.Выполнить();     
	
	// Также подбираем подходящий шаблон из регистра шаблонов
	ДанныеОснований			= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеОснований"].ПолучитьДанные().Выгрузить();
	ПерваяСтрокаОснования	= ДанныеОснований[0];
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШаблоныНазначенияПлатежаСрезПоследних.Шаблон КАК Шаблон
		|ИЗ
		|	РегистрСведений.ШаблоныНазначенияПлатежа.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидОперации = &ВидОперации
		|				И ВидДоговораДоверительногоУправления = &ВидДоговораДоверительногоУправления
		|				И Контрагент = &Контрагент
		|				И ВЫБОР
		|					КОГДА &ВидЗадолженностиИлиДоговора <> НЕОПРЕДЕЛЕНО
		|						ТОГДА ВидЗадолженностиИлиДоговора = &ВидЗадолженностиИлиДоговора
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ШаблоныНазначенияПлатежаСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", 								ДокументОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", 							ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("ВидОперации", 							ВидОперацииБэкОфиса);
	Запрос.УстановитьПараметр("ВидДоговораДоверительногоУправления",	ПерваяСтрокаОснования.ВидДоговораДоверительногоУправленияДляШаблона);
	Запрос.УстановитьПараметр("Контрагент",								ПерваяСтрокаОснования.Контрагент);
	Запрос.УстановитьПараметр("ВидЗадолженностиИлиДоговора",			ПерваяСтрокаОснования.ВидЗадолженностиИлиДоговора); 
	
	Если ТипЗнч(ПерваяСтрокаОснования.ВидЗадолженностиИлиДоговора) = Тип("СправочникСсылка.ВидыЗадолженности")
		И ЗначениеЗаполнено(ПерваяСтрокаОснования.ВидЗадолженностиИлиДоговора)
		И ПерваяСтрокаОснования.ВидЗадолженностиИлиДоговора.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.Налоги) Тогда
		СтрНДС = "";
	Иначе	
		СтрНДС = ". " + ?(ДокументОбъект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"), 
								"Без НДС", 
								"В т.ч. НДС (" + СокрЛП(РаботаСНалогамиКлиентСервер.ПолучитьСтавкуНДС(ДокументОбъект.СтавкаНДС)) + "%) " + Формат(ДокументОбъект.СуммаНДС, "ЧРД=-; ЧГ=0") + " руб.");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		// Есть готовый шаблон 
		Результат = СокрЛП(Выборка.Шаблон); 
		Для Каждого Колонка Из ДанныеОснований.Колонки Цикл
			Результат = СтрЗаменить(Результат, "[" + Колонка.Имя + "]", ПредставлениеЗначения(ПерваяСтрокаОснования[Колонка.Имя]));
		КонецЦикла;  
		
		// Если в шаблоне есть период начисления, заполняем отдельно
		Если СтрНайти(Результат, "[ПериодНачисления]") > 0
			И ДанныеОснований.Колонки.Найти("НачалоПериодаНачисления") <> Неопределено
			И ДанныеОснований.Колонки.Найти("ОкончаниеПериодаНачисления") <> Неопределено
			И ЗначениеЗаполнено(ПерваяСтрокаОснования.НачалоПериодаНачисления)
			И ЗначениеЗаполнено(ПерваяСтрокаОснования.ОкончаниеПериодаНачисления) Тогда
			
			Результат = СтрЗаменить(
							Результат,
							"[ПериодНачисления]",
							ПредставлениеПериода(ПерваяСтрокаОснования.НачалоПериодаНачисления, КонецДня(ПерваяСтрокаОснования.ОкончаниеПериодаНачисления), "ФП = Истина")); 
			
		КонецЕсли;
		
		// Уберем лишнюю точкув конце, если появилась
		Если Прав(Результат, 1) = "." Тогда			
			Результат = СокрЛП(Лев(Результат, СтрДлина(Результат)-1));
		КонецЕсли;	
			
		Возврат Результат + СтрНДС; 
		
	КонецЕсли;
	
	СтрВидДокумента = "";
	СтрУслуга = "Оплата ";
	
	// Платежи в бюджет обрабатываем отдельно
	Если ДокументОбъект.ПеречислениеВБюджет И ТипОснования = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
		
		Если ПерваяСтрокаОснования.ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда Тогда
			
			Результат = "Единый налоговый платеж";			
			
		ИначеЕсли ПерваяСтрокаОснования.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.НДФЛ) Тогда
			
			Результат = СтрШаблон("Единый налоговый платеж. НДФЛ по доходам физ. лиц - учредителей доверительного управления, налог %1 руб. удержан, как налоговый агент по Договорам Д.У", 
									Формат(ДокументОбъект.Сумма, "ЧРД=-; ЧГ=0")) + СтрНДС;
									
		ИначеЕсли ПерваяСтрокаОснования.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоНалогуНаПрибыль Тогда
			
			Результат = СтрШаблон("Налог на прибыль организаций с доходов, полученных в виде дивидендов от Российских организаций %1, налог удержан %2, как налоговый агент по договору ДУ %3 от %4", 
									"", 
									Формат(ДокументОбъект.Сумма, "ЧРД=-; ЧГ=0"), 
									ПерваяСтрокаОснования.СчетДУ_НомерДоговора, 
									Формат(ПерваяСтрокаОснования.СчетДУ_ДатаЗаключения, "ДФ=dd.MM.yyyy")) + СтрНДС;
									
		КонецЕсли;
		
	Иначе	
	
		// Из первой строки: описание услуги, основание, период		
		СтрУслуга = "";
		Если ДанныеОснований.Колонки.Найти("ВидЗадолженности") <> Неопределено 
			И ЗначениеЗаполнено(ПерваяСтрокаОснования.ВидЗадолженности) Тогда
			
			Если ПерваяСтрокаОснования.ВидЗадолженности = Справочники.ВидыЗадолженности.РасходыПоВознаграждениюАудитора Тогда
				СтрУслуга = "Оплата за проведение аудиторской проверки";
			ИначеЕсли ПерваяСтрокаОснования.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВозмещениюСтраховыхПремий Тогда
				СтрУслуга = "Оплата договоров страхования";
			ИначеЕсли ПерваяСтрокаОснования.ВидЗадолженности = Справочники.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария Тогда
				СтрУслуга = "Оплата вознаграждения СД (Услуги специализированного депозитария)";
			ИначеЕсли ПерваяСтрокаОснования.ВидЗадолженности = Справочники.ВидыЗадолженности.РасходыПоУслугамДепозитария Тогда	
				СтрУслуга = "За депозитарные услуги";
			ИначеЕсли ПерваяСтрокаОснования.ВидЗадолженности = Справочники.ВидыЗадолженности.НеобходимыеРасходыСпецдепозитария Тогда	
				СтрУслуга = "Возмещение расходов спецдепозитария";	
			ИначеЕсли ПерваяСтрокаОснования.ВидЗадолженности = Справочники.ВидыЗадолженности.РасходыПоВознаграждениюСпецрегистратора Тогда	
				СтрУслуга = "Оплата вознаграждения СР";	// период начисления	
			ИначеЕсли ПерваяСтрокаОснования.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющего Тогда	
				СтрУслуга = "Оплата вознаграждения управляющего";	
			ИначеЕсли ПерваяСтрокаОснования.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоВознаграждениюУправляющегоПлатаЗаРазмещение Тогда	
				СтрУслуга = "Вознаграждение УК за размещение";		
			КонецЕсли;
			
			Если Справочники.ВидыЗадолженности.ТребуетсяУказаниеПериодаНачисленияЗадолженности(
						ДокументОбъект.Организация,
						ПерваяСтрокаОснования.ВидЗадолженности,
						ДокументОбъект.Дата,
						ПерваяСтрокаОснования.ВидДоговораДоверительногоУправления) Тогда
				СтрУслуга = СтрУслуга + " за " + ПредставлениеПериода(ПерваяСтрокаОснования.НачалоПериодаНачисления, КонецДня(ПерваяСтрокаОснования.ОкончаниеПериодаНачисления), "ФП = Истина");	
			КонецЕсли;
			
		КонецЕсли;
		
		// Из назначения платежа берем первое предложение
		Если ДанныеОснований.Колонки.Найти("НазначениеПлатежа") <> Неопределено 
			И Не ПустаяСтрока(ПерваяСтрокаОснования.НазначениеПлатежа) Тогда
			
			// В некоторых поручениях на вывод назначение платежа заполнено целиком и не требует дозаполнения.
			// Такие определяем по тексту НДС			
			СтрУслуга = СокрЛП(ПерваяСтрокаОснования.НазначениеПлатежа);
			Если СтрНайти(СтрУслуга, "Без НДС") = 0 
				И СтрНайти(СтрУслуга, "НДС не облагается") = 0 Тогда
										
				СтрУслуга = СтрУслуга +	СтрШаблон(". Требование № %1 от %2.Без НДС",
											ПерваяСтрокаОснования.НомерВходящегоДокумента, 
											Формат(ПерваяСтрокаОснования.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy"));
			КонецЕсли;
										
			Возврат СтрУслуга;
						
		ИначеЕсли ДанныеОснований.Колонки.Найти("НазначениеПлатежа") <> Неопределено Тогда
			
			СтрУслуга = ?(ТипОснования = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств"), "Перевод денежных средств", "Возврат денежных средств");
			
		КонецЕсли;
		
		// У кредитных инструментов свои особенности
		Если ТипОснования = Тип("ДокументСсылка.Распоряжение") Или ТипОснования = Тип("ДокументСсылка.РазмещениеКредитногоИнструмента") Тогда
			
			СтрУслуга = СтрШаблон("Размещение денежных средств по %1 №%2 от %3", 
							ПерваяСтрокаОснования.ВидДоговора, 
							ПерваяСтрокаОснования.НомерДоговора, 
							Формат(ПерваяСтрокаОснования.ДатаЗаключения, "ДФ=dd.MM.yyyy"));
							
			Если Не ПустаяСтрока(ПерваяСтрокаОснования.НомерПодтверждения) Тогда
				СтрУслуга = СтрУслуга + СтрШаблон(" (Подтверждение №%1 от %2)", ПерваяСтрокаОснования.НомерПодтверждения, Формат(ПерваяСтрокаОснования.ДатаПодтверждения, "ДФ=dd.MM.yyyy")); 				
			КонецЕсли;	
			
		КонецЕсли;		
		
		// Если в основаниях несколько договоров, их не используем, т. к. ограничение на количество символов в назначении платежа
		// Если один, берем из первой строки
		СтрДоговор = "";
		Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Договоры") <> Неопределено Тогда
			Договоры = Запрос.МенеджерВременныхТаблиц.Таблицы["_Договоры"].ПолучитьДанные().Выгрузить();
			Если Договоры.Количество() = 1 Тогда
				СтрДоговор = СтрШаблон(" по договору %1№%2 от %3",
					?(ПустаяСтрока(ПерваяСтрокаОснования.НомерДоговора), "", "ДУ "), 
					?(ПустаяСтрока(ПерваяСтрокаОснования.НомерДоговора), ПерваяСтрокаОснования.СчетДУ_НомерДоговора, ПерваяСтрокаОснования.НомерДоговора),
					Формат(?(ПустаяСтрока(ПерваяСтрокаОснования.НомерДоговора), ПерваяСтрокаОснования.СчетДУ_ДатаЗаключения, ПерваяСтрокаОснования.ДатаЗаключения), "ДФ=dd.MM.yyyy"));
			КонецЕсли;
		КонецЕсли;
		
		СтрВидДокумента = "";
		Если ДанныеОснований.Колонки.Найти("ВидВходящегоДокумента") <> Неопределено 
			И ЗначениеЗаполнено(ПерваяСтрокаОснования.ВидВходящегоДокумента) Тогда
			
			Если ПерваяСтрокаОснования.ВидВходящегоДокумента = Перечисления.ВидыВходящихДокументов.Счет Тогда
				СтрВидДокумента = " по счету №";
			ИначеЕсли ПерваяСтрокаОснования.ВидВходящегоДокумента = Перечисления.ВидыВходящихДокументов.СчетФактура Тогда
				СтрВидДокумента = " по счету-фактуре №";
			ИначеЕсли ПерваяСтрокаОснования.ВидВходящегоДокумента = Перечисления.ВидыВходящихДокументов.Акт Тогда
				СтрВидДокумента = " по акту №";
			ИначеЕсли ПерваяСтрокаОснования.ВидВходящегоДокумента = Перечисления.ВидыВходящихДокументов.ОтчетБрокера Тогда
				СтрВидДокумента = " по отчету брокера №";
			ИначеЕсли ПерваяСтрокаОснования.ВидВходящегоДокумента = Перечисления.ВидыВходящихДокументов.УПД Тогда
				СтрВидДокумента = " по УПД №";
			Иначе
				СтрВидДокумента = ПерваяСтрокаОснования.ВидВходящегоДокумента;
			КонецЕсли;
			
		КонецЕсли;
		
		СтрВходящиеДокументы = "";
		Если Не ПустаяСтрока(СтрВидДокумента) Тогда
			
			МассивВходящихДокументов = Новый Массив;
			Для Каждого СтрокаОснования Из ДанныеОснований Цикл
				Если Не ПустаяСтрока(СтрокаОснования.НомерВходящегоДокумента) Тогда
					МассивВходящихДокументов.Добавить(СтрокаОснования.НомерВходящегоДокумента + " от " + Формат(СтрокаОснования.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy"));
				КонецЕсли;
			КонецЦикла;	
						
			Если МассивВходящихДокументов.Количество() > 0 Тогда
				СтрВходящиеДокументы = " " + СтрСоединить(МассивВходящихДокументов, ", ");
			КонецЕсли;
			
		КонецЕсли;	
		
		Результат = СтрУслуга + СтрДоговор + СтрВидДокумента + СтрВходящиеДокументы + СтрНДС;
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеЗначения(Значение)
	
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		Результат = Формат(Значение, "ДФ=dd.MM.yyyy");
	ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
		Результат = Формат(Значение, "ЧГ=0");
	Иначе
		Результат = СокрЛП(Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НомерПлатежногоПоручения(Организация, РасчетныйСчет, Дата) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтрокаБанковскойВыписки.Ссылка КАК СтрокаБанковскойВыписки,
		|	СтрокаБанковскойВыписки.НомерПлатежногоДокумента КАК НомерПлатежногоПоручения,
		|	ДЛИНАСТРОКИ(СтрокаБанковскойВыписки.НомерПлатежногоДокумента) КАК ДлинаНомера
		|ПОМЕСТИТЬ _СтрокиВыписки
		|ИЗ
		|	Документ.СтрокаБанковскойВыписки КАК СтрокаБанковскойВыписки
		|ГДЕ
		|	СтрокаБанковскойВыписки.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СтрокаБанковскойВыписки.Организация = &Организация
		|	И СтрокаБанковскойВыписки.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	И СтрокаБанковскойВыписки.ВидПлатежногоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежныхДокументов.ПлатежноеПоручение)
		|	И СтрокаБанковскойВыписки.РасчетныйСчет = &РасчетныйСчет
		|	И НЕ СтрокаБанковскойВыписки.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(МАКСИМУМ(ПлатежноеПоручениеИсходящее.НомерПлатежногоПоручения), 0) КАК Номер,
		|	""0"" КАК НомерСтрокой
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручениеИсходящее
		|ГДЕ
		|	ПлатежноеПоручениеИсходящее.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ПлатежноеПоручениеИсходящее.Организация = &Организация
		|	И ПлатежноеПоручениеИсходящее.НомерПлатежногоПоручения <> 0
		|	И ПлатежноеПоручениеИсходящее.РасчетныйСчет = &РасчетныйСчет
		|	И НЕ ПлатежноеПоручениеИсходящее.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ЕСТЬNULL(МАКСИМУМ(_СтрокиВыписки.НомерПлатежногоПоручения), ""0"")
		|ИЗ
		|	_СтрокиВыписки КАК _СтрокиВыписки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(_СтрокиВыписки.ДлинаНомера) КАК ДлинаНомера
		|		ИЗ
		|			_СтрокиВыписки КАК _СтрокиВыписки) КАК НомераСМаксимальнойДлиной
		|		ПО _СтрокиВыписки.ДлинаНомера = НомераСМаксимальнойДлиной.ДлинаНомера");
	
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ДатаНачала",				НачалоГода(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания",			КонецГода(Дата));	
	Запрос.УстановитьПараметр("РасчетныйСчет", 			РасчетныйСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Выбираем максимальный из полученных  
	Результат = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Номер <> 0 Тогда
			Результат = ?(Результат < Выборка.Номер, Выборка.Номер, Результат);
		КонецЕсли;
		
		Если Выборка.НомерСтрокой <> "0" Тогда
			НомерЧислом = Число(Выборка.НомерСтрокой);
			Результат = ?(Результат < НомерЧислом, НомерЧислом, Результат);	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат + 1;
	
КонецФункции

Процедура ДозаполнитьПлатежноеПоручениеПоОснованиям(ДокументОбъект) Экспорт
	
	Если ДокументОбъект.Основания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипОснования = ТипЗнч(ДокументОбъект.Основания[0].Основание);
	
	Запрос = Новый Запрос;
	Если ТипОснования = Тип("ДокументСсылка.Оплата") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
			|	ВложенныйЗапрос.Сумма КАК Сумма,
			|	ВложенныйЗапрос.Основание КАК Основание,
			|	ВложенныйЗапрос.Основание.ВидЗадолженности КАК ВидЗадолженности,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ОснованиеОснования) = ТИП(Документ.НачислениеЗадолженности)
			|			ТОГДА ВложенныйЗапрос.ОснованиеОснования.НомерВходящегоДокумента
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК НомерВходящегоДокумента,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ОснованиеОснования) = ТИП(Документ.НачислениеЗадолженности)
			|			ТОГДА ВложенныйЗапрос.ОснованиеОснования.ДатаВходящегоДокумента
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ДатаВходящегоДокумента,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ОснованиеОснования) = ТИП(Документ.НачислениеЗадолженности)
			|			ТОГДА ВложенныйЗапрос.ОснованиеОснования.ВидВходящегоДокумента
			|		ИНАЧЕ """"
			|	КОНЕЦ КАК ВидВходящегоДокумента,
			|	ВложенныйЗапрос.Основание.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ИЗ
			|	(ВЫБРАТЬ
			|		ОплатаОснования.Ссылка КАК Основание,
			|		ОплатаОснования.Основание КАК ОснованиеОснования,
			|		СУММА(ОплатаОснования.СуммаНДС) КАК СуммаНДС,
			|		СУММА(ОплатаОснования.СуммаОплаты + ОплатаОснования.СуммаОплатыКупона) КАК Сумма
			|	ИЗ
			|		Документ.Оплата.Основания КАК ОплатаОснования
			|	ГДЕ
			|		ОплатаОснования.Ссылка В(&Ссылка)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ОплатаОснования.Ссылка,
			|		ОплатаОснования.Основание) КАК ВложенныйЗапрос";
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.НачислениеЗадолженности") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НачислениеЗадолженности.СуммаНДС КАК СуммаНДС,
			|	НачислениеЗадолженности.Сумма КАК Сумма,
			|	НачислениеЗадолженности.Ссылка КАК Основание,
			|	НачислениеЗадолженности.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
			|	НачислениеЗадолженности.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
			|	НачислениеЗадолженности.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
			|	НачислениеЗадолженности.Ссылка.ВидВходящегоДокумента КАК ВидВходящегоДокумента,
			|	НачислениеЗадолженности.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ИЗ
			|	Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженности
			|ГДЕ
			|	НачислениеЗадолженности.Ссылка В(&Ссылка)";
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПоручениеНаДвижениеДенежныхСредств.Сумма КАК Сумма,
			|	0 КАК СуммаНДС,
			|	ПоручениеНаДвижениеДенежныхСредств.Ссылка КАК Основание,
			|	ПоручениеНаДвижениеДенежныхСредств.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
			|	ПоручениеНаДвижениеДенежныхСредств.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
			|	ПоручениеНаДвижениеДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ИЗ
			|	Документ.ПоручениеНаДвижениеДенежныхСредств КАК ПоручениеНаДвижениеДенежныхСредств
			|ГДЕ
			|	ПоручениеНаДвижениеДенежныхСредств.Ссылка В(&Ссылка)";	
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПоручениеНаПереводДенежныхСредств") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПоручениеНаПереводДенежныхСредств.Сумма КАК Сумма,
			|	0 КАК СуммаНДС,
			|	ПоручениеНаПереводДенежныхСредств.Ссылка КАК Основание,
			|	ПоручениеНаПереводДенежныхСредств.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ИЗ
			|	Документ.ПоручениеНаПереводДенежныхСредств КАК ПоручениеНаПереводДенежныхСредств
			|ГДЕ
			|	ПоручениеНаПереводДенежныхСредств.Ссылка В(&Ссылка)";
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.Распоряжение") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Распоряжение.Сумма КАК Сумма,
			|	0 КАК СуммаНДС,
			|	Распоряжение.Ссылка КАК Основание,
			|	Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ИЗ
			|	Документ.Распоряжение КАК Распоряжение
			|ГДЕ
			|	Распоряжение.Ссылка В(&Ссылка)";	
		
	Иначе 
		
		Возврат;
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Ссылка",			ДокументОбъект.Основания.Выгрузить().ВыгрузитьКолонку("Основание"));
	Запрос.УстановитьПараметр("ВалютаУчета",	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.Организация, "ВалютаУчета"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТекСумма 	= 0;
	ТекСуммаНДС = 0;
	Пока Выборка.Следующий() Цикл
		
		ТекСумма 	= ТекСумма + Выборка.Сумма;    				
		ТекСуммаНДС = ТекСуммаНДС + Выборка.СуммаНДС;
		
		НайдСтрокиОснований = ДокументОбъект.Основания.НайтиСтроки(Новый Структура("Основание", Выборка.Основание));
		
		Если НайдСтрокиОснований.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(НайдСтрокиОснований[0], Выборка,, "Основание");
		КонецЕсли;
		
	КонецЦикла;	
	
	Если (ТекСумма <> 0 И ДокументОбъект.Сумма <> ТекСумма)
		Или (ТекСуммаНДС <> 0 И ДокументОбъект.СуммаНДС <> ТекСуммаНДС) Тогда
		ДокументОбъект.Сумма				= ТекСумма;
		ДокументОбъект.СуммаНДС				= ТекСуммаНДС;
		ДокументОбъект.НазначениеПлатежа	= ТекстНазначенияПлатежа(ДокументОбъект);
	КонецЕсли;
	
КонецПроцедуры

Функция РеквизитыПеречисленияВБюджетПоУмолчанию() Экспорт
	
	Возврат Новый Структура("ТекстПолучателя,КодБК,КодОКТМО,ПоказательДаты,ПоказательНомера,ПоказательОснования,ПоказательПериода,ПоказательТипа,СтатусСоставителя",
						"Казначейство России (ФНС России)",
	                    Справочники.КодыБюджетнойКлассификации.Налоги,
						"0",
						"0",
						"0",
						"0",
						"0",
						"",
						"01");
	
КонецФункции          

// В случаях, когда сначала формируется платежное поручение не на основании другого документа, а документ движения денежных средств
// создается после загрузки выписки, нужно связать платежное поручение с этим документом для отражения в структуре подчиненности
//
Процедура ДобавитьОснованиеКПлатежномуПоручениюПриНеобходимости(ПлатежноеПоручение, ДокументОснование, Отказ) Экспорт
	
	Если ПлатежноеПоручение.Основания.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПлатежноеПоручениеОбъект = ПлатежноеПоручение.ПолучитьОбъект();
	НоваяСтрока = ПлатежноеПоручениеОбъект.Основания.Добавить();
	
	НоваяСтрока.Основание = ДокументОснование;
	
	Попытка 
		ПлатежноеПоручениеОбъект.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;	
	
КонецПроцедуры
